pmk-taurus.yml
execution:
 - scenario: simple
   concurrency: 2
   ramp-up: 5
   hold-for: 120

scenarios:
  simple:
    script: pmk b2c portal-click&collect.jmx

reporting:
 - module: passfail
   criteria:
   - "avg-rt>1000ms for 5s, continue as failed"
   - "fail>10% for 10s, continue as failed"
 - module: junit-xml
   filename: ./loadtest-result.xml
   data-source: pass-fail